#+TITLE:First steps with the shell - literate programming
#+AUTHOR:
#+SUBTITLE:CSC 420 Operating Systems Lyon College Spring 2024
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:sh :results output

1) Put your name at the top on the =#+author= line and write "pledged"
   next to it.

2) There are three terminal programs available in Emacs, too - open them:
   1. the regular shell (open with ~M-x shell~). Exit it with =exit=.
   2. the =eshell=, which is a shell emulator written in Emacs Lisp (open
      with ~M-x eshell~). Exit it with =exit=.
   3. the terminal, which is a proper terminal inside Emacs (open with
      ~M-x term RET~). Exit it by killing the current buffer (~C-x k~).

3) Try some of the earlier commands in each of these shells:
   - find out who you are 
   - find out where your computer is on the network
   - show date and time 
   - show available disk space in human-readable format 
   - show amount of free memory
   - see all running processes

4) Remember (and try it): the shell, ~M-n/p~ moves around the command
   history buffer.
   
5) Below, create a new code block with ~<s TAB~ for each task and add
   the header argument ~sh~

6) Find out who you are:
   #+begin_src sh
     whoami
   #+end_src

   #+RESULTS:
   : marcus

7) find out where your computer is on the network:
   #+begin_src sh
     hostname -I
   #+end_src

   #+RESULTS:
   : 172.26.166.41 

8) show the date and time:
   #+begin_src sh
     date
   #+end_src

   #+RESULTS:
   : Tue Jan 30 11:06:48 CST 2024

9) show available disk space in a format suitable for humans (only
   show the first five lines):
   #+begin_src sh
     df -H | head -n 5
   #+end_src

   #+RESULTS:
   : Filesystem      Size  Used Avail Use% Mounted on
   : none            4.1G  4.1k  4.1G   1% /mnt/wsl
   : none            510G  280G  231G  55% /usr/lib/wsl/drivers
   : /dev/sdc        1.1T  4.1G  1.1T   1% /
   : none            4.1G   82k  4.1G   1% /mnt/wslg

10) show the amount of free memory:
    #+begin_src sh
      free
    #+end_src

    #+RESULTS:
    :               total        used        free      shared  buff/cache   available
    : Mem:        7993668      371588     6999772        2392      622308     7377448
    : Swap:       2097152           0     2097152

11) see all running process (refreshed every 5 seconds):
    #+begin_src sh
      top
    #+end_src

    #+RESULTS:


    
